import styles from '../scss/css-modules/assortmentCards.module.css';
import AssortmentCardComponent from './AssortmentCardComponent';

const AssortmentCardsComponent = () => {
  const assortment = [
    {
      id: 0,
      title: 'Колонна Ионическая (большая)',
      price: 32000,
      img: 'Колона Ионическая (большая) 32.000.jpg',
    },
    {
      id: 1,
      title: 'Колонна Ионическая (малая)',
      price: 26000,
      img: 'Колона Ионическая (малая) 26.000.jpg',
    },
    {
      id: 2,
      title: 'Колонна Неоклассический модерн',
      price: 36000,
      img: 'Колона Неоклассический модерн 36.000.jpg',
    },
    {
      id: 3,
      title: 'Колонна Дорическая ( руст.)',
      price: 36000,
      img: 'Колонна Дорическая ( руст.) 36.000.jpg',
    },
    {
      id: 4,
      title: 'Колонна Дорическая (кан. руст.)',
      price: 36000,
      img: 'Колонна Дорическая (кан. руст.) 36.000.jpg',
    },
    {
      id: 5,
      title: 'Колонна Дорическая (кан.эн.)',
      price: 39000,
      img: 'Колонна Дорическая (кан.эн.) 39.000.jpg',
    },
    {
      id: 6,
      title: 'Колонна Древний Восток (Малая)',
      price: 24000,
      img: 'Колонна Древний Восток (Малая) 24.000.jpg',
    },
    {
      id: 7,
      title: 'Колонна Древний Восток',
      price: 32000,
      img: 'Колонна Древний Восток 32.000.jpg',
    },
    {
      id: 8,
      title: 'Колонна Древний восток винтовая',
      price: 60000,
      img: 'Колонна Древний восток винтовая 60,000.jpg',
    },
    {
      id: 9,
      title: 'Колонна Ионическая (Композитная)',
      price: 36000,
      img: 'Колонна Ионическая (Композитная) 36.000.jpg',
    },
    {
      id: 10,
      title: 'Колонна Коринфская (Большая)',
      price: 35000,
      img: 'Колонна Коринфская (Большая) 35.000.jpg',
    },
    {
      id: 11,
      title: 'Колонна Коринфская (Малая)',
      price: 28000,
      img: 'Колонна Коринфская (Малая) 28.000.jpg',
    },
    {
      id: 12,
      title: 'Колонна Тосканская',
      price: 20000,
      img: 'Колонна Тосканская 20.000.jpg',
    },
    {
      id: 13,
      title: 'Пилястра Барокко',
      price: 24000,
      img: 'Пилястра Барокко 24.000.jpg',
    },
    {
      id: 14,
      title: 'Пилястра Дорическая',
      price: 14500,
      img: 'Пилястра Дорическая 14.500.jpg',
    },
    {
      id: 15,
      title: 'Пилястра Дорическая 2',
      price: 14500,
      img: 'Пилястра Дорическая 2 14.500.jpg',
    },
    {
      id: 16,
      title: 'Пилястра Коринфская (Большая)',
      price: 18500,
      img: 'Пилястра Коринфская (Большая) 18.500.jpg',
    },
    {
      id: 17,
      title: 'Пилястра Коринфская (Средняя)',
      price: 16000,
      img: 'Пилястра Коринфская (Средняя) 16.000.jpg',
    },
    {
      id: 18,
      title: 'Колонна Неоклассический модерн 2',
      price: 36000,
      img: 'Колонна Неоклассический модерн 2 36.000.jpg',
    },
    {
      id: 19,
      title: 'Колонна Античная',
      price: 74000,
      img: 'Колонна Античная 64,74.000.jpg',
    },
    {
      id: 20,
      title: 'Колонна Борочная',
      price: 140000,
      img: 'Колонна Борочная 140.000.jpg',
    },
    {
      id: 21,
      title: 'Колонна Винтовая',
      price: 44000,
      img: 'Колонна Винтовая 44,000.jpg',
    },
    {
      id: 22,
      title: 'Колонна Винтовая с подсветкой',
      price: 120000,
      img: 'Колонна Винтовая с подсветкой 120.000.jpg',
    },
    {
      id: 23,
      title: 'Колонна Модерновая',
      price: 75000,
      img: 'Колонна Модерновая 75.000.jpg',
    },
    {
      id: 24,
      title: 'Колонна Модерновая малая',
      price: 28000,
      img: 'Колонна Модерновая малая 28.000.jpg',
    },
  ];

  const assortmentSorted = assortment.sort((a, b) => (a.price > b.price ? 1 : -1));

  return (
    <div className={styles.cards}>
      {assortmentSorted.map((card, index) => (
        <AssortmentCardComponent key={card.id} card={card} index={index} />
      ))}
    </div>
  );
};

export default AssortmentCardsComponent;
