import styles from '../scss/css-modules/assortmentCards.module.css';
import AssortmentCardComponent from './AssortmentCardComponent';

const AssortmentCardsComponent = () => {
  const assortment = [
    {
      id: 0,
      title: 'Колона Ионическая (большая)',
      price: '32000',
      img: 'Колона Ионическая (большая) 32.000.jpg',
    },
    {
      id: 1,
      title: 'Колона Ионическая (малая)',
      price: '26000',
      img: 'Колона Ионическая (малая) 26.000.jpg',
    },
    {
      id: 2,
      title: 'Колона Неоклассический модерн',
      price: '36000',
      img: 'Колона Неоклассический модерн 36.000.jpg',
    },
    {
      id: 3,
      title: 'Колонна Дорическая ( руст.)',
      price: '36000',
      img: 'Колонна Дорическая ( руст.) 36.000.jpg',
    },
    {
      id: 4,
      title: 'Колонна Дорическая (кан. руст.)',
      price: '36000',
      img: 'Колонна Дорическая (кан. руст.) 36.000.jpg',
    },
    {
      id: 5,
      title: 'Колонна Дорическая (кан.эн.)',
      price: '39000',
      img: 'Колонна Дорическая (кан.эн.) 39.000.jpg',
    },
    {
      id: 6,
      title: 'Колонна Древний Восток (Малая)',
      price: '24000',
      img: 'Колонна Древний Восток (Малая) 24.000.jpg',
    },
    {
      id: 7,
      title: 'Колонна Древний Восток',
      price: '32000',
      img: 'Колонна Древний Восток 32.000.jpg',
    },
    {
      id: 8,
      title: 'Колонна Древний восток винтовая',
      price: '60000',
      img: 'Колонна Древний восток винтовая 60,000.jpg',
    },
    {
      id: 9,
      title: 'Колонна Ионическая (Композитная)',
      price: '36000',
      img: 'Колонна Ионическая (Композитная) 36.000.jpg',
    },
    {
      id: 10,
      title: 'Колонна Коринфская (Большая)',
      price: '35000',
      img: 'Колонна Коринфская (Большая) 35.000.jpg',
    },
    {
      id: 11,
      title: 'Колонна Коринфская (Малая)',
      price: '28000',
      img: 'Колонна Коринфская (Малая) 28.000.jpg',
    },
    {
      id: 12,
      title: 'Колонна Тосканская',
      price: '20000',
      img: 'Колонна Тосканская 20.000.jpg',
    },
    {
      id: 13,
      title: 'Пилястра Барокко',
      price: '24000',
      img: 'Пилястра Барокко 24.000.jpg',
    },
    {
      id: 14,
      title: 'Пилястра Дорическая',
      price: '14500',
      img: 'Пилястра Дорическая 14.500.jpg',
    },
    {
      id: 15,
      title: 'Пилястра Дорическая 2',
      price: '14500',
      img: 'Пилястра Дорическая 2 14.500.jpg',
    },
    {
      id: 16,
      title: 'Пилястра Коринфская (Большая)',
      price: '18500',
      img: 'Пилястра Коринфская (Большая) 18.500.jpg',
    },
    {
      id: 17,
      title: 'Пилястра Коринфская (Средняя)',
      price: '16000',
      img: 'Пилястра Коринфская (Средняя) 16.000.jpg',
    },
  ];

  return (
    <div className={styles.cards}>
      {assortment.map((card) => (
        <AssortmentCardComponent key={card.id} card={card} />
      ))}
    </div>
  );
};

export default AssortmentCardsComponent;
